//Од стандарден влез се чита природен број N (N <= 100), како и низа a[ ] од N цели броеви.
//Да се напише функција void premesti(а, n) која го преместува секој пронајден негативен број на крајот на низата.
// По преместувањето редоследот на позитивните броеви треба да остане ист како и во оригиналната низа, а истото важи и за редоследот на негативните.
//Нaпишете програма која ќе ја повика функцијата premesti за внесената низа a[ ] и потоа ќе ја испечати новодобиената низа.

#include<stdio.h>
void premesti(int a[], int n){
    int res[n];
    int  l = 0;
    for (int i = 0; i < n ; i++) {
        if (a[i] >= 0){
            res[l] = a[i];
            l++;
        }
    }
    if (l == 0) {
        return;
    }
    for (int i = 0 ; i < n ; i++){
        if (a[i] < 0) {
            res[l] = a[i];
            l++;
        }
    }
    for(int i = 0; i < n; i++){
        a[i] = res[i];
        }
}

int main(){
    int n, i;
    scanf("%d", &n);
    int a[n];
    for(i = 0; i < n; i++) {
        scanf("%d", &a[i]);
    }
    premesti(a, n);
    for(i = 0; i < n; i++) {
        printf("%d ", a[i]);
    }
    return 0;
}
