//Да се напише програма во која се вчитува матрица од цели броеви A со N редици и N * 2 колони
// (N не е поголемо од 50). Програмата треба да ја трансформира вчитаната матрица во нова матрица B, така што
// сите елементи десно од N-тата колона ќе ги префрли под N-тата редица, односно од матрица со димензија
// N редици и 2 * N колони ќе се добие матрица со 2 * N редици x N колони.

#include <stdio.h>

int main() {
    int n;
    scanf("%d",&n);
    int A[100][100], B[100][100];
    int i, j;
    for (i = 0; i < n; i++) {
        for (j = 0; j < n*2; j++) {
            scanf("%d", &A[i][j]);
        }
    }
    for (i = 0; i < n; i++) {
        for (j = 0; j < n; j++) {
            B[i][j] = A[i][j];
        }
        for (j = n; j < n * 2; j++) {
            B[i + n][j - n] = A[i][j];
        }
    }
    for (i = 0; i < n*2; i++) {
        for (j = 0; j < n; j++) {
            printf("%d ", B[i][j]);
        }
        printf("\n");
    }

    return 0;
}
