//Oд стандарден влез се вчитува еден цел број X, димензии на матрица M и N (цели броеви), како и елементите на матрицата
// со димензии M x N (цели броеви). Да се напише програма што ќе ги промени редиците на матрицата на следниот начин:
//Ако збирот на елементите од редот е поголем од X, елементите на тој ред добиваат вредност 1
//Ако збирот на елементите од редот е помал од X, елементите на тој ред добиваат вредност -1
//Ако збирот на елементите од редот е еднаков на X, елементите на тој ред добиваат вредност 0
//Променетата матрица да се испечати на екран.
#include<stdio.h>
int main(){
    int x;
    scanf("%d",&x);
    int m,n;
    scanf("%d %d",&m,&n);
    int matrix[m][n];
    int sum;
    for(int i=0;i<m;i++){
        sum = 0;
        for(int j=0;j<n;j++){
            scanf("%d",&matrix[i][j]);
            sum += matrix[i][j];
        }
        if(sum > x){
            for(int j = 0;j < n;j++){
                matrix[i][j] = 1;
            }
        }
        if(sum < x) {
            for (int j = 0; j < n; j++) {
                matrix[i][j] = -1;
            }
        }
        if(x == sum) {
            for (int j = 0; j < n; j++) {
                matrix[i][j] = 0;
            }
        }
    }
    for(int i=0;i<m;i++){
        for(int j=0;j<n;j++){
            printf("%d ",matrix[i][j]);
        }
        printf("\n");
    }
    return 0;
}
