//Од стаднарден влез се читаат N низи од знаци (стрингови) не подолги од 80 знаци. На почетокот на програмата се читаат два цели броеви:
//N - бројот на низи од знаци кои ќе се читаат и
//X - поместување.
//Секоја од вчитаните низи од знаци треба да се трансформира на тој начин што секоја од малите и големите букви (a-z, A-Z)
// се заменува со истата буква поместена X места понапред во азбуката (a-z). Ако се надмине опсегот на буквите во азбуката,
// се продолжува циклично од почетокот на азбуката. Трансформираната низа да се отпечати на СИ.
//Трансформацијата да се имплементира со посебна рекурзивна функција.

#include<stdio.h>
#include<string.h>

void pomestuvanje(char* str, int x) {
    if (*str == '\0') {
        return;
    }
    if (*str >= 'a' && *str <= 'z') {
        *str = (*str - 'a' + x) % 26 + 97; // ascii number for 'a' is 97
    }
    if (*str >= 'A' && *str <= 'Z') {
        *str = (*str - 'A' + x) % 26 + 65; // ascii number for 'A' is 65
    }
    return pomestuvanje(str + 1, x);
}



int main(){

    char niza[100];
    int n,x;
    scanf("%d%d\n",&n,&x);
    for(int i=0;i<n;i++){
        fgets(niza,100, stdin);
        niza[strlen(niza)-1]='\0';
        pomestuvanje(niza, x);
        printf("%s\n", niza);

    }

    return 0;
}
