//Еден елемент од матрица ја дели матрицата на 4 квадранти (прикажани на сликата). Притоа самиот елемент кој ја дели матрицата припаѓа
// во четвртиот квадрант (-5 во примерот на сликата).
//Од стандарден влез се внесува матрица со димензии NxM (1 <= N, M < 100). Потоа се внесуваат два броеви кои
// претставуваат индекси на еден елемент од матрицата.
//Да се најдат сумите на секој од квадрантите и да се испечатат на стандарен излез. Притоа се печати сумата за првиот квадрант,
// па за вториот, па третиот и на крај за четвртиот. Доколку не може да се креира квадрант, тогаш за сумата на тој квадрант треба да се испечати 0.

#include <stdio.h>
int main()
{
    int i, j;
    int n, m;
    int x, y;
    int matrix[100][100];
    int sum1 = 0, sum2 = 0, sum3 = 0, sum4 = 0;
    scanf("%d %d", &n, &m);
    for (i = 0; i < n; i++)
    {
        for (j = 0; j < m; j++)
        {
            scanf("%d", &matrix[i][j]);
        }
    }
    scanf("%d %d", &x, &y);

    for (i = 0; i < x; i++)
    {
        for (j = y; j < m; j++)
        {
            sum1 += matrix[i][j];
        }
    }

    for (i = 0; i < x; i++)
    {
        for (j = 0; j < y; j++)
        {
            sum2 += matrix[i][j];
        }
    }

    for (i = x; i < n; i++)
    {
        for (j = 0; j < y; j++)
        {
            sum3 += matrix[i][j];
        }
    }

    for (i = x; i < n; i++)
    {
        for (j = y; j < m; j++)
        {
            sum4 += matrix[i][j];
        }
    }
    printf ("%d %d %d %d",sum1,sum2,sum3,sum4);

    return 0;
}
